first_gantt_garph={0: {'task_name': 'observe', 'begin_time': 1.0, 'duration': 1},
 1: {'task_name': 'observe', 'begin_time': 1.0, 'duration': 1},
 2: {'task_name': 'observe', 'begin_time': -0.0, 'duration': 1},
 3: {'task_name': 'attack', 'begin_time': 2.0, 'duration': 1},
 4: {'task_name': 'attack', 'begin_time': 2.0, 'duration': 1},
 5: {'task_name': 'attack', 'begin_time': 3.0, 'duration': 1}}

final_gantt_graph={1: {'task_name': 'observe', 'begin_time': 1, 'duration': 8},
 2: {'task_name': 'observe', 'begin_time': 1, 'duration': 7},
 0: {'task_name': 'observe', 'begin_time': 9, 'duration': 7},
 3: {'task_name': 'attack', 'begin_time': 17, 'duration': 32},
 4: {'task_name': 'attack', 'begin_time': 17, 'duration': 12},
 5: {'task_name': 'attack', 'begin_time': 50, 'duration': 52}}

zanfa_data_list=["全面进攻","步步为营","围点打援","占场扫描","",""]


zanfa_data={'全面进攻':{
'zanfa_name':"全面进攻",
  "zanfa_group":['联合进攻','梯度进攻','梯度侦察','联合侦察','诱骗'],
 "zanfa_explain":"侦查目标区域，摸清敌方的目标分布，安装设定顺序先后进攻敌方单位",
 'zanfa_example':[{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '003','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '005','目标':'蓝方'},
{'波次':1, '战法': '诱骗', '主体': '红方', '地点' : '005','目标':'蓝方'},
{'波次':1, '战法': '诱骗', '主体': '红方', '地点' : '003','目标':'蓝方'},
{'波次':2, '战法': '联合进攻', '主体': '红方', '地点' : '003','目标':'步兵'},
{'波次':2, '战法': '联合进攻', '主体': '红方', '地点' : '003','目标':'炮兵'},
{'波次':3, '战法': '联合进攻', '主体': '红方', '地点' : '003','目标':'蓝方'},
                  ]
},
'步步为营':{
'zanfa_name':"步步为营",
  "zanfa_group":['梯度支持','联合支持','梯度侦察','联合侦察','联合进攻','梯度进攻'],
 "zanfa_explain":'''依次的蚕食敌方区域，
   维持占据空间，压缩敌方战场面
   积。并控制战争烈度''',
 'zanfa_example':[{'波次':1, '战法': '联合进攻', '主体': '红方', '地点' : '006','目标':'炮兵'},
{'波次':1, '战法': '联合进攻', '主体': '红方', '地点' : '006','目标':'步兵'},
{'波次':2, '战法': '联合进攻', '主体': '红方', '地点' : '006','目标':'蓝方'},
{'波次':3, '战法': '联合支持', '主体': '红方', '地点' : '006','目标':'步兵'},
{'波次':3, '战法': '联合进攻', '主体': '红方', '地点' : '007','目标':'炮兵'},
{'波次':4, '战法': '联合支持', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':4, '战法': '联合进攻', '主体': '红方', '地点' : '002','目标':'蓝方'},
{'波次':5, '战法': '联合支持', '主体': '红方', '地点' : '002','目标':'蓝方'}
                  ]
},
    '围点打援':{
'zanfa_name':"围点打援",
  "zanfa_group":['梯度支持','联合支持','梯度侦察','联合侦察','梯度进攻','联合进攻'],
 "zanfa_explain":'''攻击目标区域，并利用周围区域牵制来援的敌军，避免援军改变态势''',
 'zanfa_example':[{'波次': 1, '战法': '梯度侦察', '主体': '红方', '地点': '006', '目标': '蓝方'},
        {'波次': 1, '战法': '梯度侦察', '主体': '红方', '地点': '007', '目标': '蓝方'},
               {'波次': 1, '战法': '梯度侦察', '主体': '红方', '地点': '002', '目标': '蓝方'},
           {'波次': 2,'战法': '联合支持', '主体': '红方', '地点': '007', '目标': '蓝方'},
           {'波次': 2, '战法': '联合支持', '主体': '红方', '地点': '002', '目标': '蓝方'},
           {'波次': 2, '战法': '梯度进攻', '主体': '红方', '地点': '006', '目标': '步兵'},
           {'波次': 2, '战法': '梯度进攻', '主体': '红方', '地点': '006', '目标': '炮兵'},
           {'波次': 2, '战法': '梯度进攻', '主体': '红方', '地点': '007', '目标': '蓝方'}]

},'占场扫描':{
'zanfa_name':"占场扫描",
  "zanfa_group":['梯度支持','联合支持','梯度侦察','联合侦察','联合进攻','梯度进攻','诱骗'],
 "zanfa_explain":'''攻击并占据敌方区域每次占据空间，压缩敌方战场面积，并重复扫描保证占据地区安全。''',
 'zanfa_example':[{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '006','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '002','目标':'蓝方'},
{'波次':1, '战法': '诱骗', '主体': '红方', '地点' : '002','目标':'蓝方'},
{'波次':1, '战法': '诱骗', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':2, '战法': '梯度进攻', '主体': '红方', '地点' : '006','目标':'步兵'},
{'波次':2, '战法': '梯度进攻', '主体': '红方', '地点' : '006','目标':'炮兵'},
{'波次':2, '战法': '梯度进攻', '主体': '红方', '地点' : '006','目标':'蓝方'},
{'波次':2, '战法': '联合进攻', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':2, '战法': '联合进攻', '主体': '红方', '地点' : '002','目标':'炮兵'},
{'波次':3, '战法': '联合支持', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':3, '战法': '联合支持', '主体': '红方', '地点' : '002','目标':'蓝方'},
{'波次':3, '战法': '联合侦察', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':3, '战法': '联合侦察', '主体': '红方', '地点' : '002','目标':'蓝方'}
        ]
},
    '重点防御':{
'zanfa_name':"重点防御",
  "zanfa_group":['梯度支持','联合支持','梯度侦察','联合侦察'],
 "zanfa_explain":'''侦察并感知敌方目标进程，维持己方战场规划布局，重点有针对性地防止敌方突破己方防御阵地''',
 'zanfa_example':[{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '006','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '002','目标':'蓝方'},
{'波次':2, '战法': '联合支持', '主体': '红方', '地点' : '006','目标':'蓝方'},
{'波次':2, '战法': '联合支持', '主体': '红方', '地点' : '002','目标':'蓝方'} ]
},
    '防守反击':{
'zanfa_name':"防守反击",
  "zanfa_group":['梯度支持','联合支持','梯度侦察','联合侦察','联合进攻','梯度进攻','诱骗'],
 "zanfa_explain":'''依次对敌方攻击进行针对防守，后形成战略反击布局，并实施己方突破反击''',
 'zanfa_example':[{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '006','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':1, '战法': '联合侦察', '主体': '红方', '地点' : '002','目标':'蓝方'},
{'波次':1, '战法': '联合支持', '主体': '红方', '地点' : '006','目标':'蓝方'},
{'波次':1, '战法': '联合支持', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':1, '战法': '诱骗', '主体': '红方', '地点' : '002','目标':'蓝方'},
{'波次':1, '战法': '诱骗', '主体': '红方', '地点' : '007','目标':'蓝方'},
{'波次':2, '战法': '联合进攻', '主体': '红方', '地点' : '006','目标':'炮兵'},
{'波次':2, '战法': '联合进攻', '主体': '红方', '地点' : '007','目标':'步兵'}
]
}
}

subtask_list=[(0, 'redall', 'observe', 'g', 'all'),
  (1, 'redall', 'observe', 'm', 'all'),
  (2, 'redall', 'observe', 'l', 'all'),
  (3, 'redall', 'attack', 'l', 'infantry'),
  (4, 'redall', 'attack', 'l', 'artillery'),
  (5, 'redall', 'attack', 'l', 'all')]